#server端
import socket
import pretty_errors

print("""""
████████▄               ▄████████           ▀████    ▐████▀              ▄█   ▄█▄ 
███   ▀███             ███    ███             ███▌   ████▀              ███ ▄███▀ 
███    ███             ███    █▀               ███  ▐███                ███▐██▀   
███    ███             ███                     ▀███▄███▀               ▄█████▀    
███    ███           ▀███████████              ████▀██▄               ▀▀█████▄    
███    ███                    ███             ▐███  ▀███                ███▐██▄   
███   ▄███              ▄█    ███            ▄███     ███▄              ███ ▀███▄ 
████████▀             ▄████████▀            ████       ███▄             ███   ▀█▀ 
                                                                        ▀         
"""
      "")
server = socket.socket(socket.AF_INET, socket.SOCK_STREAM)  #创建socket并说明其使用协议
server.setsockopt(socket.SOL_SOCKET, socket.SO_REUSEADDR, 1)  #
server.bind(("127.0.0.1", 25466))  #绑定服务器ip及端口号
server.listen()  #开始监听客户端请求

print('[\033[1;32m服务器以开启>>>>>>>>>>>>>>>>>>>>>>>>>>>\033[0m]' + "等待客户端连接...")
#这里的'[\033[32m'是设置字符串颜色,[\033表示的是要设置字体颜色,1表示颜色高亮,32m表示字体具体颜色显示
# 说明：
# 前景色         背景色           颜色
# ---------------------------------------
# 30                40              黑色
# 31                41              红色
# 32                42              绿色
# 33                43              黃色
# 34                44              蓝色
# 35                45              洋红
# 36                46              青色
# 37                47              白色
# 显示方式             　 意义
# ----------------------------------
# 0                    终端默认设置
# 1                    高亮显示
# 22　　　　　　　　　　　非高亮显示
# 4                    使用下划线
# 24　　　　　　　　　　　去下划线
# 5                    闪烁
# 25　　　　　　　　　　　去闪烁
# 7                    反白显示
# 27　　　　　　　　　　　非反显
# 8                    不可见
# 28　　　　　　　　　　　可见

# 例：
# \033[1;32;41m   #---1-高亮显示 32-前景色绿色  40-背景色红色---
# \033[0m         #---采用终端默认设置，即缺省颜色---
try:
    while True:
        sock, addr = server.accept()
        print("客户端已连接")
        data = sock.recv(1024)
        sock.send(data)
finally:
    sock.close()
    server.close()
